#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # module.eks.data.aws_eks_cluster.eks[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_eks_cluster" "eks"  {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_authority[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0menabled_cluster_log_types[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0midentity[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_network_config[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "sandbox"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrole_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mvpc_config[0m[0m                = (known after apply)
    }

[1m  # module.eks.data.aws_eks_cluster_auth.eks_auth[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "eks_auth"  {
      [32m+[0m [0m[1m[0mid[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m  = "sandbox"
      [32m+[0m [0m[1m[0mtoken[0m[0m = (sensitive value)
    }

[1m  # module.eks.data.tls_certificate.eks_tls[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "tls_certificate" "eks_tls"  {
      [32m+[0m [0m[1m[0mcertificates[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m          = (known after apply)
    }

[1m  # module.eks.aws_eks_cluster.eks_cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_cluster" "eks_cluster" {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_authority[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0menabled_cluster_log_types[0m[0m = [
          [32m+[0m [0m"api",
          [32m+[0m [0m"audit",
          [32m+[0m [0m"authenticator",
          [32m+[0m [0m"controllerManager",
          [32m+[0m [0m"scheduler",
        ]
      [32m+[0m [0m[1m[0mendpoint[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0midentity[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "sandbox"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrole_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                      = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                  = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mversion[0m[0m                   = (known after apply)

      [32m+[0m [0mkubernetes_network_config {
          [32m+[0m [0m[1m[0mip_family[0m[0m         = "ipv4"
          [32m+[0m [0m[1m[0mservice_ipv4_cidr[0m[0m = "192.168.0.0/16"
        }

      [32m+[0m [0mvpc_config {
          [32m+[0m [0m[1m[0mcluster_security_group_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mendpoint_private_access[0m[0m   = false
          [32m+[0m [0m[1m[0mendpoint_public_access[0m[0m    = true
          [32m+[0m [0m[1m[0mpublic_access_cidrs[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0msecurity_group_ids[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0msubnet_ids[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mvpc_id[0m[0m                    = (known after apply)
        }
    }

[1m  # module.eks.aws_eks_fargate_profile.farget_profile[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_fargate_profile" "farget_profile" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcluster_name[0m[0m           = "sandbox"
      [32m+[0m [0m[1m[0mfargate_profile_name[0m[0m   = "sandbox-dev-sandbox-farget-profile"
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mpod_execution_role_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Service" = "dev"
        }

      [32m+[0m [0mselector {
          [32m+[0m [0m[1m[0mlabels[0m[0m    = {
              [32m+[0m [0m"app" = "myapp"
            }
          [32m+[0m [0m[1m[0mnamespace[0m[0m = "dev"
        }
      [32m+[0m [0mselector {
          [32m+[0m [0m[1m[0mnamespace[0m[0m = "default"
        }
      [32m+[0m [0mselector {
          [32m+[0m [0m[1m[0mnamespace[0m[0m = "kube-system"
        }
    }

[1m  # module.eks.aws_iam_openid_connect_provider.eks_oidc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "eks_oidc" {
      [32m+[0m [0m[1m[0marn[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mclient_id_list[0m[0m  = [
          [32m+[0m [0m"sts.amazonaws.com",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m            = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m        = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mthumbprint_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m             = (known after apply)
    }

[1m  # module.eks.aws_iam_policy.eks_alb_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "eks_alb_controller" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "sandbox-dev-sandbox-ingress-controller"
      [32m+[0m [0m[1m[0mpath[0m[0m      = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"iam:CreateServiceLinkedRole",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mStringEquals = {
                              [32m+[0m [0m"iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ec2:DescribeAccountAttributes",
                          [32m+[0m [0m"ec2:DescribeAddresses",
                          [32m+[0m [0m"ec2:DescribeAvailabilityZones",
                          [32m+[0m [0m"ec2:DescribeInternetGateways",
                          [32m+[0m [0m"ec2:DescribeVpcs",
                          [32m+[0m [0m"ec2:DescribeVpcPeeringConnections",
                          [32m+[0m [0m"ec2:DescribeSubnets",
                          [32m+[0m [0m"ec2:DescribeSecurityGroups",
                          [32m+[0m [0m"ec2:DescribeInstances",
                          [32m+[0m [0m"ec2:DescribeNetworkInterfaces",
                          [32m+[0m [0m"ec2:DescribeTags",
                          [32m+[0m [0m"ec2:GetCoipPoolUsage",
                          [32m+[0m [0m"ec2:DescribeCoipPools",
                          [32m+[0m [0m"elasticloadbalancing:DescribeLoadBalancers",
                          [32m+[0m [0m"elasticloadbalancing:DescribeLoadBalancerAttributes",
                          [32m+[0m [0m"elasticloadbalancing:DescribeListeners",
                          [32m+[0m [0m"elasticloadbalancing:DescribeListenerCertificates",
                          [32m+[0m [0m"elasticloadbalancing:DescribeSSLPolicies",
                          [32m+[0m [0m"elasticloadbalancing:DescribeRules",
                          [32m+[0m [0m"elasticloadbalancing:DescribeTargetGroups",
                          [32m+[0m [0m"elasticloadbalancing:DescribeTargetGroupAttributes",
                          [32m+[0m [0m"elasticloadbalancing:DescribeTargetHealth",
                          [32m+[0m [0m"elasticloadbalancing:DescribeTags",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"cognito-idp:DescribeUserPoolClient",
                          [32m+[0m [0m"acm:ListCertificates",
                          [32m+[0m [0m"acm:DescribeCertificate",
                          [32m+[0m [0m"iam:ListServerCertificates",
                          [32m+[0m [0m"iam:GetServerCertificate",
                          [32m+[0m [0m"waf-regional:GetWebACL",
                          [32m+[0m [0m"waf-regional:GetWebACLForResource",
                          [32m+[0m [0m"waf-regional:AssociateWebACL",
                          [32m+[0m [0m"waf-regional:DisassociateWebACL",
                          [32m+[0m [0m"wafv2:GetWebACL",
                          [32m+[0m [0m"wafv2:GetWebACLForResource",
                          [32m+[0m [0m"wafv2:AssociateWebACL",
                          [32m+[0m [0m"wafv2:DisassociateWebACL",
                          [32m+[0m [0m"shield:GetSubscriptionState",
                          [32m+[0m [0m"shield:DescribeProtection",
                          [32m+[0m [0m"shield:CreateProtection",
                          [32m+[0m [0m"shield:DeleteProtection",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ec2:AuthorizeSecurityGroupIngress",
                          [32m+[0m [0m"ec2:RevokeSecurityGroupIngress",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ec2:CreateSecurityGroup",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"ec2:CreateTags",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull         = {
                              [32m+[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          [32m+[0m [0mStringEquals = {
                              [32m+[0m [0m"ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"ec2:CreateTags",
                          [32m+[0m [0m"ec2:DeleteTags",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull = {
                              [32m+[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              [32m+[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"ec2:AuthorizeSecurityGroupIngress",
                          [32m+[0m [0m"ec2:RevokeSecurityGroupIngress",
                          [32m+[0m [0m"ec2:DeleteSecurityGroup",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull = {
                              [32m+[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"elasticloadbalancing:CreateLoadBalancer",
                          [32m+[0m [0m"elasticloadbalancing:CreateTargetGroup",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull = {
                              [32m+[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"elasticloadbalancing:CreateListener",
                          [32m+[0m [0m"elasticloadbalancing:DeleteListener",
                          [32m+[0m [0m"elasticloadbalancing:CreateRule",
                          [32m+[0m [0m"elasticloadbalancing:DeleteRule",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"elasticloadbalancing:AddTags",
                          [32m+[0m [0m"elasticloadbalancing:RemoveTags",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull = {
                              [32m+[0m [0m"aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              [32m+[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = [
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"elasticloadbalancing:AddTags",
                          [32m+[0m [0m"elasticloadbalancing:RemoveTags",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          [32m+[0m [0m"arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"elasticloadbalancing:ModifyLoadBalancerAttributes",
                          [32m+[0m [0m"elasticloadbalancing:SetIpAddressType",
                          [32m+[0m [0m"elasticloadbalancing:SetSecurityGroups",
                          [32m+[0m [0m"elasticloadbalancing:SetSubnets",
                          [32m+[0m [0m"elasticloadbalancing:DeleteLoadBalancer",
                          [32m+[0m [0m"elasticloadbalancing:ModifyTargetGroup",
                          [32m+[0m [0m"elasticloadbalancing:ModifyTargetGroupAttributes",
                          [32m+[0m [0m"elasticloadbalancing:DeleteTargetGroup",
                        ]
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mNull = {
                              [32m+[0m [0m"aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mResource  = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"elasticloadbalancing:RegisterTargets",
                          [32m+[0m [0m"elasticloadbalancing:DeregisterTargets",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"elasticloadbalancing:SetWebAcl",
                          [32m+[0m [0m"elasticloadbalancing:ModifyListener",
                          [32m+[0m [0m"elasticloadbalancing:AddListenerCertificates",
                          [32m+[0m [0m"elasticloadbalancing:RemoveListenerCertificates",
                          [32m+[0m [0m"elasticloadbalancing:ModifyRule",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mpolicy_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m      = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = {
          [32m+[0m [0m"Service" = "dev"
        }
    }

[1m  # module.eks.aws_iam_role.eks_alb_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_alb_controller" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "sandbox-dev-sandbox-eks-oidc-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.eks.aws_iam_role.eks_iam_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_iam_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "sandbox-dev-sandbox-eks-cluster-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.eks.aws_iam_role.farget_pod_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "farget_pod_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mCondition = {
                          [32m+[0m [0mArnLike = {
                              [32m+[0m [0m"aws:SourceArn" = "arn:aws:eks:*:*:fargateprofile/*/*"
                            }
                        }
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "eks-fargate-pods.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "sandbox-dev-sandbox-eks-farget-pod-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.eks.aws_iam_role_policy_attachment.eks_alb_controller_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_alb_controller_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m       = "sandbox-dev-sandbox-eks-oidc-role"
    }

[1m  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m [0m[1m[0mrole[0m[0m       = "sandbox-dev-sandbox-eks-cluster-role"
    }

[1m  # module.eks.aws_iam_role_policy_attachment.eks_vpc_resource[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_vpc_resource" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m [0m[1m[0mrole[0m[0m       = "sandbox-dev-sandbox-eks-cluster-role"
    }

[1m  # module.eks.aws_iam_role_policy_attachment.far[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "far" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      [32m+[0m [0m[1m[0mrole[0m[0m       = "sandbox-dev-sandbox-eks-farget-pod-role"
    }

[1m  # module.eks.aws_security_group.eks_control_plane_sg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "eks_control_plane_sg" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "eks controller security group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "sandbox-dev-sandbox-eks-controller-sg"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.eks.aws_security_group.eks_worker_node_sg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "eks_worker_node_sg" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "eks worker node security group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "sandbox-dev-sandbox-eks-worker-sg"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.eks.aws_security_group_rule.control_plane_egress_ephemeral[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "control_plane_egress_ephemeral" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 1025
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 65535
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "egress"
    }

[1m  # module.eks.aws_security_group_rule.control_plane_ingress_https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "control_plane_ingress_https" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 443
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 443
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.eks.aws_security_group_rule.worker_node_egress_all[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "worker_node_egress_all" {
      [32m+[0m [0m[1m[0mcidr_blocks[0m[0m              = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 0
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "-1"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 0
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "egress"
    }

[1m  # module.eks.aws_security_group_rule.worker_node_ingress_ephemeral[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "worker_node_ingress_ephemeral" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 1025
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 65535
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.eks.aws_security_group_rule.worker_node_ingress_https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "worker_node_ingress_https" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 443
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 443
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.eks.aws_security_group_rule.worker_node_ingress_self[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "worker_node_ingress_self" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = 0
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "-1"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = true
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = 0
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.eks.kubernetes_namespace.ns[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_namespace" "ns" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"name" = "corebbackend"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app" = "corebbackend"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "corebbackend"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.eks.kubernetes_namespace.ns[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_namespace" "ns" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"name" = "syncengine"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app" = "syncengine"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "syncengine"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.eks.kubernetes_namespace.ns[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_namespace" "ns" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"name" = "optimizationengine"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app" = "optimizationengine"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "optimizationengine"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.eks.kubernetes_namespace.ns[3][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_namespace" "ns" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = {
              [32m+[0m [0m"name" = "executionengine"
            }
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app" = "executionengine"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "executionengine"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.eks.kubernetes_service_account.eks_alb[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_service_account" "eks_alb" {
      [32m+[0m [0m[1m[0mautomount_service_account_token[0m[0m = true
      [32m+[0m [0m[1m[0mdefault_secret_name[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mannotations[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m             = "aws-load-balancer-controller"
          [32m+[0m [0m[1m[0mnamespace[0m[0m        = "kube-system"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # module.k8s-addons.helm_release.external_dns[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "helm_release" "external_dns" {
      [32m+[0m [0m[1m[0matomic[0m[0m                     = false
      [32m+[0m [0m[1m[0mchart[0m[0m                      = "external-dns"
      [32m+[0m [0m[1m[0mcleanup_on_fail[0m[0m            = false
      [32m+[0m [0m[1m[0mcreate_namespace[0m[0m           = false
      [32m+[0m [0m[1m[0mdependency_update[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_crd_hooks[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_openapi_validation[0m[0m = false
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m           = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlint[0m[0m                       = false
      [32m+[0m [0m[1m[0mmanifest[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_history[0m[0m                = 0
      [32m+[0m [0m[1m[0mmetadata[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "cloudflare-external-dns"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                  = "default"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m              = false
      [32m+[0m [0m[1m[0mrender_subchart_notes[0m[0m      = true
      [32m+[0m [0m[1m[0mreplace[0m[0m                    = false
      [32m+[0m [0m[1m[0mrepository[0m[0m                 = "https://kubernetes-sigs.github.io/external-dns/"
      [32m+[0m [0m[1m[0mreset_values[0m[0m               = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m               = false
      [32m+[0m [0m[1m[0mskip_crds[0m[0m                  = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = "deployed"
      [32m+[0m [0m[1m[0mtimeout[0m[0m                    = 300
      [32m+[0m [0m[1m[0mvalues[0m[0m                     = [
          [32m+[0m [0m<<-EOT
                # Default values for external-dns.
                # This is a YAML-formatted file.
                # Declare variables to be passed into your templates.
                
                image:
                  repository: k8s.gcr.io/external-dns/external-dns
                  # Overrides the image tag whose default is v{{ .Chart.AppVersion }}
                  tag: "v0.11.0"
                  pullPolicy: IfNotPresent
                
                imagePullSecrets: []
                nameOverride: ""
                fullnameOverride: ""
                
                serviceAccount:
                  # Specifies whether a service account should be created
                  create: true
                  # Annotations to add to the service account
                  annotations: {}
                  # The name of the service account to use.
                  # If not set and create is true, a name is generated using the fullname template
                  name: ""
                
                rbac:
                  # Specifies whether RBAC resources should be created
                  create: true
                  additionalPermissions: {}
                
                # Annotations to add to the Deployment
                deploymentAnnotations: {}
                
                podLabels: {}
                
                # Annotations to add to the Pod
                podAnnotations: {}
                
                shareProcessNamespace: false
                
                podSecurityContext:
                  fsGroup: 65534
                
                securityContext:
                  runAsNonRoot: true
                  runAsUser: 65534
                  readOnlyRootFilesystem: true
                  capabilities:
                    drop: ["ALL"]
                
                priorityClassName: ""
                
                terminationGracePeriodSeconds:
                
                serviceMonitor:
                  enabled: false
                  additionalLabels: {}
                  interval: 1m
                  scrapeTimeout: 10s
                
                env:
                  - name: CF_API_KEY
                    value: ""
                  - name: CF_API_EMAIL
                    value:  ""
                livenessProbe:
                  httpGet:
                    path: /healthz
                    port: http
                  initialDelaySeconds: 10
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 2
                  successThreshold: 1
                
                readinessProbe:
                  httpGet:
                    path: /healthz
                    port: http
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                service:
                  port: 7979
                  annotations: {}
                
                extraVolumes: []
                
                extraVolumeMounts: []
                
                resources: {}
                
                nodeSelector: {}
                
                tolerations: []
                
                affinity: {}
                
                topologySpreadConstraints: []
                
                logLevel: info
                logFormat: text
                
                interval: 1m
                triggerLoopOnEvent: false
                
                sources:
                  - service
                  - ingress
                
                policy: upsert-only
                
                registry: txt
                txtOwnerId: ""
                txtPrefix: ""
                txtSuffix: ""
                
                domainFilters: []
                
                provider: cloudflare
                
                extraArgs: ["--domain-filter=","--zone-id-filter=","--cloudflare-proxied"]
            EOT,
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m                     = false
      [32m+[0m [0m[1m[0mversion[0m[0m                    = "1.9.0"
      [32m+[0m [0m[1m[0mwait[0m[0m                       = true
      [32m+[0m [0m[1m[0mwait_for_jobs[0m[0m              = false
    }

[1m  # module.k8s-addons.helm_release.ingress_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "helm_release" "ingress_controller" {
      [32m+[0m [0m[1m[0matomic[0m[0m                     = false
      [32m+[0m [0m[1m[0mchart[0m[0m                      = "aws-load-balancer-controller"
      [32m+[0m [0m[1m[0mcleanup_on_fail[0m[0m            = false
      [32m+[0m [0m[1m[0mcreate_namespace[0m[0m           = false
      [32m+[0m [0m[1m[0mdependency_update[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_crd_hooks[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_openapi_validation[0m[0m = false
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m           = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlint[0m[0m                       = false
      [32m+[0m [0m[1m[0mmanifest[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_history[0m[0m                = 0
      [32m+[0m [0m[1m[0mmetadata[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "aws-load-balancer-controller"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                  = "kube-system"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m              = false
      [32m+[0m [0m[1m[0mrender_subchart_notes[0m[0m      = true
      [32m+[0m [0m[1m[0mreplace[0m[0m                    = false
      [32m+[0m [0m[1m[0mrepository[0m[0m                 = "https://aws.github.io/eks-charts"
      [32m+[0m [0m[1m[0mreset_values[0m[0m               = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m               = false
      [32m+[0m [0m[1m[0mskip_crds[0m[0m                  = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = "deployed"
      [32m+[0m [0m[1m[0mtimeout[0m[0m                    = 300
      [32m+[0m [0m[1m[0mverify[0m[0m                     = false
      [32m+[0m [0m[1m[0mversion[0m[0m                    = "1.4.1"
      [32m+[0m [0m[1m[0mwait[0m[0m                       = true
      [32m+[0m [0m[1m[0mwait_for_jobs[0m[0m              = false

      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "clusterName"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "sandbox"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "region"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "ap-south-1"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "serviceAccount.create"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "false"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "serviceAccount.name"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "aws-load-balancer-controller"
        }
      [32m+[0m [0mset {
          [32m+[0m [0m[1m[0mname[0m[0m  = "vpcId"
          [32m+[0m [0m[1m[0mvalue[0m[0m = (known after apply)
        }
    }

[1m  # module.network.aws_eip.nat_ip[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eip" "nat_ip" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-0"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-0"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true
    }

[1m  # module.network.aws_eip.nat_ip[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eip" "nat_ip" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-1"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-1"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true
    }

[1m  # module.network.aws_eip.nat_ip[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eip" "nat_ip" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-2"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-2"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true
    }

[1m  # module.network.aws_internet_gateway.igw[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_internet_gateway" "igw" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m = {
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = (known after apply)
    }

[1m  # module.network.aws_nat_gateway.nat[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_nat_gateway" "nat" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m    = "public"
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1a"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1a"
          [32m+[0m [0m"Service" = "dev"
        }
    }

[1m  # module.network.aws_nat_gateway.nat[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_nat_gateway" "nat" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m    = "public"
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1b"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1b"
          [32m+[0m [0m"Service" = "dev"
        }
    }

[1m  # module.network.aws_nat_gateway.nat[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_nat_gateway" "nat" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m    = "public"
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1c"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-ap-south-1c"
          [32m+[0m [0m"Service" = "dev"
        }
    }

[1m  # module.network.aws_route.private[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route" "private" {
      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)
    }

[1m  # module.network.aws_route.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route" "private" {
      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)
    }

[1m  # module.network.aws_route.private[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route" "private" {
      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)
    }

[1m  # module.network.aws_route.public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route" "public" {
      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"
      [32m+[0m [0m[1m[0mgateway_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)
    }

[1m  # module.network.aws_route_table.private[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-0"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-0"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.network.aws_route_table.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-1"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-1"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.network.aws_route_table.private[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-2"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name"    = "sandbox-dev-private-2"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.network.aws_route_table.public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name"    = "sandbox-dev-public"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name"    = "sandbox-dev-public"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.network.aws_route_table_association.private[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.private[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.public[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.public[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.public[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.network.aws_subnet.private[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.4.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-0"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-0"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.5.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-1"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-1"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.private[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1c"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.6.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-2"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                            = "sandbox-dev-private-2"
          [32m+[0m [0m"Service"                         = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox"   = "owned"
          [32m+[0m [0m"kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.public[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.1.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = true
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-0"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-0"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.public[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.2.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = true
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-1"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-1"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.public[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "ap-south-1c"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.1.3.0/24"
      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false
      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = true
      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-2"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {
          [32m+[0m [0m"Name"                          = "sandbox-dev-public-2"
          [32m+[0m [0m"Service"                       = "dev"
          [32m+[0m [0m"kubernetes.io/cluster/sandbox" = "owned"
          [32m+[0m [0m"kubernetes.io/role/elb"        = "1"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)
    }

[1m  # module.network.aws_vpc.vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_vpc" "vpc" {
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m     = true
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                           = "10.1.0.0/16"
      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mdhcp_options_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink_dns_support[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0menable_dns_hostnames[0m[0m                 = true
      [32m+[0m [0m[1m[0menable_dns_support[0m[0m                   = true
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_tenancy[0m[0m                     = "default"
      [32m+[0m [0m[1m[0mipv6_association_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_network_border_group[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmain_route_table_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"Name"    = "sandbox-dev"
          [32m+[0m [0m"Service" = "dev"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"Name"    = "sandbox-dev"
          [32m+[0m [0m"Service" = "dev"
        }
    }

[0m[1mPlan:[0m 54 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mprivate_subnet_ids[0m[0m = [
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
    ]
  [32m+[0m [0m[1m[0mvpc_id[0m[0m             = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @akshay-g-simformsolutions, Action: `pull_request`*